"use strict";

class CountdownTimer {
  constructor({ selector, targetDate }) {
    this.selector = selector;
    this.targetDate = targetDate;
  }
  updateTimer() {
    let time = Date.parse(this.targetDate) - Date.now();
    if (time < 0) {
      time = 0;
    }
    const days = Math.floor(time / (1000 * 60 * 60 * 24));
    const hours = Math.floor((time % (1000 * 60 * 60 * 24)) / (1000 * 60 * 60));
    const mins = Math.floor((time % (1000 * 60 * 60)) / (1000 * 60));
    const secs = Math.floor((time % (1000 * 60)) / 1000);
    document.querySelector('[data-value="days"]').textContent = `${days}`;
    document.querySelector('[data-value="hours"]').textContent = `${hours}`;
    document.querySelector('[data-value="mins"]').textContent = `${mins}`;
    document.querySelector('[data-value="secs"]').textContent = `${secs}`;
    setInterval(() => {
      this.updateTimer();
    }, 1000);
  }
}
const timer = new CountdownTimer({
  selector: "#timer-1",
  targetDate: new Date("Feb 15, 2020")
});
timer.updateTimer();

// что вернет в консоль typeOf(NaN)- not defigned,undefigned,number, пустой string
//2)
//что делает команда continue в цикле switch?  1)прерывает все выполнение switch 2)Продолжает выполнение цикла,даже если условие не выполнилось
//- Прерывает выполнение текущей итерации
// отличие оператора switch от if -нет отличий,разная запись кода.2)switch может принимать больше условий ,чем if,
// 3)switch всегда имеет дефолтное значение
// применимость switch ограничена только задачами с одним общим вопросом и множеством вариантов ответов.
// что вернет метод  Object.keys(obj) 1)вернет массив, с ключами объекта obj в виде строк.
// 2)ничего не вернет,только перберет массив ключей.3)вернет ключ обьекта в виде строки
//4) вернет значение обьекта  в виде строки

//5 Можно ли использовать операцию ...spread  в литерале обьекта,при создании нового обьекта? -Да -Нет -я люблю артема
//6  Object.prototype это 1)объект прототипа Object.2)массив данных прототипа Object  
// 3)Массив полученных и изменяемыъ ключей и свойств  обьекта Object
//просто люблю Артема
//  7 Метод класса super исрользуется для :для вызова конструктора родителя.2) получения данных из 
// статистического метода внутри класса 3) создания конструктора для наследуемых обьектов
// 8 Если вставить DOM-узел после тега body то: браузер проигнорирует обращение.2)Элемент будет вставлен после тега body.
// 3) Элемент будет вставлен в конец тега body
//9 throttle это: асинхронная функция,обеспечивает контроль над количеством раз, которое функция может быть вызвана в течение промежутка времени.
// синхронная функция,обеспечивает контроль над количеством раз, которое функция может быть вызвана в течение промежутка времени.
// cинхронная функция которая выаолняется , только если прошло N миллисекунд без ее вызова
// аcинхронная функция которая выаолняется , только если прошло N миллисекунд без ее вызова

  //10) Полифил это: код, реализующий какую-либо функциональность, которая не поддерживается в некоторых версиях веб-браузеров
  // оптимизация кода и библиотек на стороне браузера 
  //создание пвсевдо-многопоточносточти,за счет распределния задач между клиентом и сервером